КАКерамика_моя_старая_база/src/InformationRegisters/ДокументыФизическихЛиц/ДокументыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДокументомУдостоверяющимЛичность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    </type>
  </resources>
  <resources>
    <name>ФамилияЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтранаВыдачи</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </resources>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НаправлениеКонвертации/КонтурЛогистика_НаправлениеКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НаправлениеКонвертации</name>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>ИсходящееВходящее</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СценарииОтправкиТитулов/КонтурЛогистика_СценарииОтправкиТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СценарииОтправкиТитулов</name>
  <comment>что будет делать действие с задачей по умолчанию по конкретной настройке конвертации документа</comment>
  <enumValues>
    <name>НеПодписыватьОтправитьВФоне</name>
  </enumValues>
  <enumValues>
    <name>НеПодписыватьОтправитьВСеансе</name>
  </enumValues>
  <enumValues>
    <name>ПодписыватьОтправитьВФоне</name>
  </enumValues>
  <enumValues>
    <name>ПодписыватьОтправитьВСеансе</name>
  </enumValues>
  <enumValues>
    <name>СоздатьЧерновик</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьВходящий</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_Сценарии/КонтурЛогистика_Сценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_Сценарии</name>
  <enumValues>
    <name>Отправка</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаСогласованногоКладовщиком_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновик_СогласованиеКладовщик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаВодителю_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаВодителю_СогласованиеКладовщик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновика_ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_Обработка_ОтправкаЧерновика</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаНеОбрабатывать</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаШаблона</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыНастроекКонвертаций/КонтурЛогистика_ТипыНастроекКонвертаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыНастроекКонвертаций</name>
  <enumValues>
    <name>Основная</name>
  </enumValues>
  <enumValues>
    <name>Расширенная</name>
  </enumValues>
  <enumValues>
    <name>Замещающая</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ФункцииЗаказаЗаявки/КонтурЛогистика_ФункцииЗаказаЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ФункцииЗаказаЗаявки</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_КонвертацияТиповые/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область КонвертацияДокументов

// См. КонтурЛогистика_КонвертацияСерверПовтИсп.ПоддерживаемыеТипыДокументовКонфигурации1С
//
Функция ПоддерживаемыеТипыДокументовКонфигурации1С(ТипДокументаЛогистика, СпецСценарий) Экспорт
	
	ТипыДокументовКонфигурации1С = Новый Массив;
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	МодульКонвертацииТиповойКонфигурации = МодульКонвертацииТиповойКонфигурации(ИмяКонфигурации);
	Если МодульКонвертацииТиповойКонфигурации = Неопределено Тогда
		Возврат ТипыДокументовКонфигурации1С;
	КонецЕсли;
	
	ТипыДокументовКонфигурации1С = МодульКонвертацииТиповойКонфигурации.ПоддерживаемыеТипыДокументовКонфигурации1С(
		ТипДокументаЛогистика, СпецСценарий);
	
	Возврат ТипыДокументовКонфигурации1С;
	
КонецФункции

// Заполняет базовые настройки конвертации
//
// Параметры:
//  КонтекстНастройкиКонвертации - Струткура	 - См. КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииДокументов
//
Процедура ЗаполнитьБазовыеНастройкиКонвертации(КонтекстНастройкиКонвертации) Экспорт
	
	// Не первые титулы
	ТипДокументаЛогистика = КонтекстНастройкиКонвертации.ТипДокументаЛогистика;
	Если ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул5
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул8
		
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
		
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02
		
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2
		
		Или ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул2 Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		КонтекстНастройкиКонвертации.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
		КонтекстНастройкиКонвертации.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
		
	ИначеЕсли ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
		
		// можно подписывать полученный, отправленный черновик, можно отправлять черновик
		КонтекстНастройкиКонвертации.Сценарий_РазрешитьПодписыватьПолученныйЧерновик = Истина;
		КонтекстНастройкиКонвертации.Сценарий_РазрешитьПодписыватьПослеОтправки = Истина;
		КонтекстНастройкиКонвертации.Сценарий_ОтправлятьНеподписанный = Истина;
	КонецЕсли;
	
	ЕстьТиповаяКонвертацияПоДокументуКонтурЛогистика = ЗаполнитьБазовыеНастройкиКонвертации_ОснованиеДокументКонтурЛогистика(КонтекстНастройкиКонвертации);
	
	Если Не ЕстьТиповаяКонвертацияПоДокументуКонтурЛогистика Тогда
		МодульКонвертацииТиповойКонфигурации = МодульКонвертацииТиповойКонфигурации(КонтекстНастройкиКонвертации.ИмяКонфигурации);
		Если МодульКонвертацииТиповойКонфигурации = Неопределено Тогда
			Возврат;
		КонецЕсли;

		КонтекстНастройкиКонвертации.Тип = Перечисления.КонтурЛогистика_ТипыНастроекКонвертаций.Основная;

		МодульКонвертацииТиповойКонфигурации.ЗаполнитьБазовыеНастройкиКонвертации(КонтекстНастройкиКонвертации);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьБазовыеНастройкиКонвертации_ОснованиеДокументКонтурЛогистика(Контекст)
	
	Если Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1 Тогда
	
		Если Контекст.ТипДокумента1С = "КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут" Тогда
			
			Контекст.ЕстьТиповаяКонвертация = Истина;
			Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
			Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
			Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
			
			Контекст.Тип = Перечисления.КонтурЛогистика_ТипыНастроекКонвертаций.Основная;
			
			Контекст.ВыводитьЗадачи = Ложь;
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;	 
	
	Возврат Ложь;
	
КонецФункции 

Функция КонвертацияПоДокументуКонтурЛогистика(Контекст)
	
	Возврат Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
		И Контекст.ТипДокумента1С = "КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут";
	
КонецФункции		

// См. КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоДокументуУчетнойСистемы
//
Функция НайтиГлавныйДокументПоДокументуУчетнойСистемы(ДокументОснование, КонтекстНастройкиКонвертации, Разделитель, ДокументОбъект) Экспорт
	
	ГлавныйДокумент = Неопределено;
	
	МодульКонвертацииТиповойКонфигурации = МодульКонвертацииТиповойКонфигурации(КонтекстНастройкиКонвертации.ИмяКонфигурации);
	Если МодульКонвертацииТиповойКонфигурации = Неопределено Тогда
		Возврат ГлавныйДокумент;
	КонецЕсли;
	
	Попытка
		ГлавныйДокумент = МодульКонвертацииТиповойКонфигурации.НайтиГлавныйДокументПоДокументуУчетнойСистемы(
			ДокументОснование, КонтекстНастройкиКонвертации, Разделитель, ДокументОбъект);
	Исключение
		НичегоНеДелам = Истина;
	КонецПопытки;
	
	Возврат ГлавныйДокумент;
	
КонецФункции

// См. КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы
//
Процедура ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(ГлавныйДокументОбъект, ДокументОснование, КонтекстНастройкиКонвертации, Переменные) Экспорт
	
	МодульКонвертацииТиповойКонфигурации = МодульКонвертацииТиповойКонфигурации(КонтекстНастройкиКонвертации.ИмяКонфигурации);
	Если МодульКонвертацииТиповойКонфигурации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Переменные = Неопределено Тогда
		Переменные = Новый Структура;
	КонецЕсли;
	
	Попытка
		МодульКонвертацииТиповойКонфигурации.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(
			ГлавныйДокументОбъект, ДокументОснование, КонтекстНастройкиКонвертации, Переменные);
	Исключение
		НичегоНеДелам = Истина;
	КонецПопытки;
	
	// Подключаемый модуль
	ПараметрыПМ = Новый Структура;
	ПараметрыПМ.Вставить("ГлавныйДокументОбъект", ГлавныйДокументОбъект);
	ПараметрыПМ.Вставить("ДокументОснование", ДокументОснование);
	ПараметрыПМ.Вставить("КонтекстНастройкиКонвертации", КонтекстНастройкиКонвертации);
	ПараметрыПМ.Вставить("Переменные", Переменные);
	
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы_После", Истина, ПараметрыПМ);
	// Подключаемый модуль - Конец
	
КонецПроцедуры

// См. КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы
//
Процедура ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ДокументОбъект, КонтекстНастройкиКонвертации, Переменные) Экспорт
	
	Если Переменные = Неопределено Тогда
		Переменные = Новый Структура;
	КонецЕсли;
	
	МодульКонвертацииТиповойКонфигурации = МодульКонвертацииТиповойКонфигурации(КонтекстНастройкиКонвертации.ИмяКонфигурации);
	Если МодульКонвертацииТиповойКонфигурации = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Если КонвертацияПоДокументуКонтурЛогистика(КонтекстНастройкиКонвертации) Тогда
			ЗаполнитьДокументТитулПоДокументуКонтурЛогистика(ДокументОбъект, КонтекстНастройкиКонвертации, Переменные);
		Иначе
			МодульКонвертацииТиповойКонфигурации.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
				ДокументОбъект, КонтекстНастройкиКонвертации, Переменные);
		КонецЕсли;
	Исключение
		НичегоНеДелам = Истина;
	КонецПопытки;
	
	// Подключаемый модуль
	ПараметрыПМ = Новый Структура;
	ПараметрыПМ.Вставить("ДокументОбъект", ДокументОбъект);
	ПараметрыПМ.Вставить("КонтекстНастройкиКонвертации", КонтекстНастройкиКонвертации);
	ПараметрыПМ.Вставить("Переменные", Переменные);
	
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ЗаполнитьДокументТитулПоДокументуУчетнойСистемы_После", Истина, ПараметрыПМ);
	// Подключаемый модуль - Конец
	
КонецПроцедуры

Процедура ЗаполнитьДокументТитулПоДокументуКонтурЛогистика(ДокументОбъект, КонтекстНастройкиКонвертации, Переменные)

	Если КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1 Тогда

		Если КонтекстНастройкиКонвертации.ТипДокумента1С = "КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут" Тогда
			
			Источник = ДокументОбъект.ДокументОснование;
			Если ДокументОбъект.ДокументыОснования.Количество() > 0 Тогда 
				МассивИсточников = ДокументОбъект.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование");
			Иначе
				МассивИсточников = Новый Массив;
				МассивИсточников.Добавить(Источник);
			КонецЕсли;	
		
			ДокументОбъект.Функция = Перечисления.КонтурЛогистика_ФункцииЗаказаЗаявки.Заказ;
			
			Если Источник.ВидТС.Количество() > 0 Тогда

				ДокументОбъект.ТСТип = Источник.ВидТС[0].ВидТС;
				Если ЗначениеЗаполнено(Источник.ВидТС[0].ТипКузов) Тогда
					ДокументОбъект.ТСТипКуз = Источник.ВидТС[0].ТипКузов;
				КонецЕсли;
				
			КонецЕсли;

			ДокументОбъект.ТСГрузопод = Источник.МассаБруттоКг;
			ДокументОбъект.ТСВместим = Источник.ОбъемГруза;
			ДокументОбъект.ПредСрПрвз = "Отсутствуют";
			ДокументОбъект.ПрвзПищПрод = "Отсутствуют";

			ДокументОбъект.ДатаЗак = Источник.ДатаДок;
			ДокументОбъект.НомЗак = Источник.НомДок;

			ДокументОбъект.Грузоотправитель = Источник.СвЭксп;
			// Перевозчика не знаем на момент формирования ЗЗ

			ДокументОбъект.ПунктПод = Источник.АдрГруз;
			ДокументОбъект.ПервыйПунктВыгрузки = Источник.АдрПунктНазн;
			ДокументОбъект.ДатВрПод = Источник.ДатОтгрС + Час(Источник.ВрОтгрС) * 3600 + Минута(Источник.ВрОтгрС) * 60;

			Если ЗначениеЗаполнено(Источник.УказКлнт) Тогда
				ДокументОбъект.ТемператураНеВыше = Источник.УказКлнт.ТемпНеВыше;
				ДокументОбъект.ТемператураНеНиже = Источник.УказКлнт.ТемпНеНиже;
				ДокументОбъект.ВлажностьНеНиже = Источник.УказКлнт.ВлажнНеНиже;
				ДокументОбъект.ВлажностьНеВыше = Источник.УказКлнт.ВлажнНеВыше;
			КонецЕсли;

			Если ЗначениеЗаполнено(Источник.ИдПарт) Тогда
				СтрокаИнфПол = ДокументОбъект.ИнфПол.Добавить();
				СтрокаИнфПол.Идентиф = "ПЭ_ИдПарт";
				СтрокаИнфПол.Значение = Источник.ИдПарт;
			КонецЕсли;
			
			Для Каждого Документ Из МассивИсточников Цикл
				ЗаполнитьТаблицуТоваровПоПЭ_Маршруту(ДокументОбъект, Источник);
			КонецЦикла;

			НоваяСтрока = ДокументОбъект.АдрПункт.Добавить();
			НоваяСтрока.Погрузка = Истина;
			НоваяСтрока.ПунктМаршрута = Источник.АдрГруз;

			НоваяСтрока = ДокументОбъект.АдрПункт.Добавить();
			НоваяСтрока.Выгрузка = Истина;
			НоваяСтрока.ПунктМаршрута = Источник.АдрПунктНазн;

			ДопПолучатель = ДокументОбъект.ДополнительныеПолучателиФайла.Добавить();
			ДопПолучатель.ОрганизацияДиадок = Источник.СвКлт;

			ДокументОбъект.Комментарий = "Создано из поручения экспедитору: " + Источник.Титул1;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// См. КонтурЛогистика_ОбработкаДокументовСервер.ВычислитьРеквизитыДокументаОснования
//
Функция ВычислитьРеквизитыДокументаОснования(ИменаРеквизитов, ДокументОбъект, Знач КонтекстНастройкиКонвертации) Экспорт
	
	ЗначенияРеквизитов = Новый Структура;
	
	МодульКонвертацииТиповойКонфигурации = МодульКонвертацииТиповойКонфигурации(КонтекстНастройкиКонвертации.ИмяКонфигурации);
	Если МодульКонвертацииТиповойКонфигурации = Неопределено Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	Попытка
		ЗначенияРеквизитов = МодульКонвертацииТиповойКонфигурации.ВычислитьРеквизитыДокументаОснования(
			ИменаРеквизитов, ДокументОбъект, КонтекстНастройкиКонвертации);
	Исключение
		НичегоНеДелам = Истина;
	КонецПопытки;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Номер счета фактура выданной по документу основания
//
// Параметры:
//  ДокументОснование	 - ДокументСсылка	 - документ основания.
// 
// Возвращаемое значение:
//  Строка - номер счета фактуры
//
Функция НомерСчетаФактураВыданной(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Номер КАК Номер
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	ВЫРАЗИТЬ(СчетФактураВыданный.ДокументОснование КАК Документ.РеализацияТоваровУслуг) = &ДокументОснование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Номер;
	Иначе
		Возврат "-";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область КонвертацияСправочников

// См. КонтурЛогистика_КонвертацияСерверПовтИсп.ПоддерживаемыеТипыСправочниковКонфигурации1С
//
Функция ПоддерживаемыеТипыСправочниковКонфигурации1С(ТипСправочникаЛогистика) Экспорт
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	МодульКонвертацииТиповойКонфигурации = МодульКонвертацииТиповойКонфигурации(ИмяКонфигурации);
	Если МодульКонвертацииТиповойКонфигурации = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ПоддерживаемыеТипыСправочников = МодульКонвертацииТиповойКонфигурации.ПоддерживаемыеТипыСправочниковКонфигурации1С(ТипСправочникаЛогистика);
	
	// Дополнения
	ДополнительныеТипы = Новый Массив;
	Если КонтурЛогистика_КонвертацияСерверПовтИсп.ЕстьРегистрДокументыФизическихЛиц() Тогда
		Если ТипСправочникаЛогистика = "КонтурЛогистика_Сотрудники" Тогда
			ДополнительныеТипы.Добавить("ФизическиеЛица");
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеТипы.Количество() <> 0 Тогда
		ТолькоНовые = Истина;
		КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ДополнитьМассивЛок(ПоддерживаемыеТипыСправочников, ДополнительныеТипы, ТолькоНовые);
	КонецЕсли;
	// Дополнения Конец
	
	Возврат ПоддерживаемыеТипыСправочников;
	
КонецФункции

// Заполняет базовые настройки конвертации справочника
//
// Параметры:
//  КонтекстНастройкиКонвертации - Струткура	 - См. КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииСправочника
//
Процедура ЗаполнитьБазовыеНастройкиКонвертацииСправочника(КонтекстНастройкиКонвертации) Экспорт
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	МодульКонвертацииТиповойКонфигурации = МодульКонвертацииТиповойКонфигурации(ИмяКонфигурации);
	Если МодульКонвертацииТиповойКонфигурации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстНастройкиКонвертации.Тип = Перечисления.КонтурЛогистика_ТипыНастроекКонвертаций.Основная;
	
	МодульКонвертацииТиповойКонфигурации.ЗаполнитьБазовыеНастройкиКонвертацииСправочника(КонтекстНастройкиКонвертации);
	
	// Дополнения
	Если КонтекстНастройкиКонвертации.ЕстьРегистрДокументыФизическихЛиц
		И КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_Сотрудники"
		И (КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = Неопределено
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "ФизическиеЛица") Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
	КонецЕсли;
	// Дополнения Конец
	
КонецПроцедуры

// Вычислить реквизиты справочника логистики по учетному объекту
//
// Параметры:
//  КонтекстНастройкиКонвертации - Структура		 - См. КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииСправочника
//  Параметры					 - Структура
//		* УчетныйОбъект				 - СправочникСсылка, ДокументСсылка	 - Учетный объект конвертации из которго берем данные.
//		* ДокументОснование			 - ДокументСсылка	 - Контекстный документ основания из которого производится заполнение документа Логистики.
//		* ДокументОбъект			 - ДокументОбъект	 - Контекстный документ в котором конвертируется реквизит.
//		* Переменные				 - Структура		 - Контекстные переменные.
//	
//	ВАЖНО! Следующие параметры: 
//		      * ДокументОснование
//			  * ДокументОбъект
//			  * Переменные
//		   могут быть незаполненными, например при обновлении из учетного объекта. Следует в обработчиках проверять их заполненность.
//
//         Кроме того, перед проверкой реквизита КонтекстНастройкиКонвертации.РеквизитТитула также следует проверять заполненность 
//		   параметра ДокументОснование.
//
//  Результат					 - Структура
//		* Успешно					 - Булеов - Признак успешной конвертации.
//		* ОписаниеОшибки			 - Строка - Описание ошибок.
//		* МассивОшибок				 - Массив - Ошибки конвертации.
//		* ВычисленныеРеквизиты		 - ТаблицаЗначений - См. КонтурЛогистика_КонвертацияСервер.ОписаниеТаблицыВычисленныхРеквизитов()
//
Процедура ВычислитьРеквизитыСправочникаЛогистикиПоУчетномуОбъекту(КонтекстНастройкиКонвертации, Параметры, Результат) Экспорт
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	МодульКонвертацииТиповойКонфигурации = МодульКонвертацииТиповойКонфигурации(ИмяКонфигурации);
	Если МодульКонвертацииТиповойКонфигурации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МодульКонвертацииТиповойКонфигурации.ВычислитьРеквизитыСправочникаЛогистикиПоУчетномуОбъекту(
		КонтекстНастройкиКонвертации, Параметры, Результат);
	
	// Дополнения
	Если КонтекстНастройкиКонвертации.ЕстьРегистрДокументыФизическихЛиц
		И КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_Сотрудники"
		И КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "ФизическиеЛица"
		И КонтекстНастройкиКонвертации.РеквизитТитула = "Водитель" Тогда
		
		ВычислитьРеквизитыВодителяИзРСДокументыФизическихЛиц(КонтекстНастройкиКонвертации, Параметры, Результат);
	КонецЕсли;
	// Дополнения Конец
	
	// Подключаемый модуль
	ПараметрыПМ = Новый Структура;
	ПараметрыПМ.Вставить("КонтекстНастройкиКонвертации", КонтекстНастройкиКонвертации);
	ПараметрыПМ.Вставить("Параметры", Параметры);
	ПараметрыПМ.Вставить("Результат", Результат);
	
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ВычислитьРеквизитыСправочникаЛогистикиПоУчетномуОбъекту_После", Истина, ПараметрыПМ);
	// Подключаемый модуль - Конец
	
КонецПроцедуры

// Добавить вычесленный реквизит в итоговый результат
//
// Параметры:
//  ВычисленныеРеквизиты		 - ТаблицаЗначений	 - Место хранения результатов
//  ИмяРеквизита				 - Строка			 - Имя расчитываемого реквизита
//  Значение					 - Произвольное		 - Вычесленное значение
//  ОбновитьИзУчетнойСистемы	 - Булево			 - Если флаг установлен, то в процессе конвертации
//													   значение этого реквизита будет обновлено из учетной системы
//
Процедура ДобавитьВычесленныйРеквизит(ВычисленныеРеквизиты, ИмяРеквизита, Значение, ОбновитьИзУчетнойСистемы = Ложь) Экспорт
	
	НоваяСтрока = ВычисленныеРеквизиты.Добавить();
	НоваяСтрока.Реквизит = ИмяРеквизита;
	НоваяСтрока.Значение = Значение;
	НоваяСтрока.Обновить = ОбновитьИзУчетнойСистемы;
	
КонецПроцедуры

#КонецОбласти

#Область БазовыеСоответствияНоменклатуры

// Предзаполняет габариты и массу записи базового соответствия номенклатуры
//
// Параметры:
//  Запись - РегистрСведенийМенеджерЗаписи.КонтурЛогистика_БазовыеСоответствияНоменклатуры
//
Процедура ЗаполнитьВесогабаритныеПараметрыБазовогоСоответствия(Запись) Экспорт
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	
	МодульКонвертацииТиповойКонфигурации = МодульКонвертацииТиповойКонфигурации(ИмяКонфигурации);
	Если МодульКонвертацииТиповойКонфигурации = Неопределено Тогда
		Возврат;
	КонецЕсли;

	МодульКонвертацииТиповойКонфигурации.ЗаполнитьВесогабаритныеПараметрыБазовогоСоответствия(Запись);
	
КонецПроцедуры

#КонецОбласти

#Область КовертацияОбъектов

// Конвертируем значение в объект логистики
//
// Параметры:
//  КонвертируемоеЗначение		 - СправочникСсылка									 - Ссылка на объект конвертации.
//  ИмяРеквизитаОбъекта			 - Строка											 - Имя реквизита заполняемого объекта.
//  СпособКонвертацииЗначения	 - Перечисления.КонтурЛогистика_СпособыКонвертации	 - Способ конвертации.
//  ДокументОснование			 - ДокуентСсылка									 - Документ на основании которго происходит заполнение.
//  ДокументОбъект				 - ДокументОбъект									 - Заполняемый документ.
// 
// Возвращаемое значение:
//  Произвольное - Вычисленное значение.
//
Функция КонвертироватьЗначениеВОбъектЛогистики(КонвертируемоеЗначение,
											   ИмяРеквизитаОбъекта,
											   СпособКонвертацииЗначения,
											   ДокументОснование,
											   ДокументОбъект,
											   Переменные = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(КонвертируемоеЗначение) Тогда
		Результат = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_КонвертироватьЗначениеВОбъектЛогистики(
			КонвертируемоеЗначение, СпособКонвертацииЗначения,
			ИмяРеквизитаОбъекта, ДокументОснование,, ДокументОбъект, Переменные);
		
		Если Результат.Успешно Тогда
			Возврат Результат.Значение;
		Иначе
			Сообщить(Результат.ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область Дополнения

Процедура ВычислитьРеквизитыВодителяИзРСДокументыФизическихЛиц(КонтекстНастройкиКонвертации, Параметры, Результат)
	
	УчетныйОбъект = Параметры.УчетныйОбъект;
	ДокументОснование = Параметры.ДокументОснование;
	ДокументОбъект = Параметры.ДокументОбъект;
	Переменные = Параметры.Переменные;
	
	// Данные водителя из РС.ДокументыФизическихЛиц
	Попытка
		ТекущийВодитель = ДокументОснование.Водитель;
		ТекущаяДата = ДокументОснование.Дата;
	Исключение
		ТекущийВодитель = Неопределено;
		ТекущаяДата = Неопределено;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ТекущийВодитель) Тогда
		Возврат;
	КонецЕсли;
	
	ФизЛицо = Справочники["ФизическиеЛица"].НайтиПоНаименованию(ТекущийВодитель);
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыФизическихЛиц.Серия КАК Серия,
	|	ДокументыФизическихЛиц.Номер КАК Номер,
	|	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|		&ДатаСреза,
	|		ФизЛицо = &ФизЛицо И ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение)) КАК ДокументыФизическихЛиц";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"РольВодитель", Истина);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ДатаРождения", ФизЛицо.ДатаРождения);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ВУСерия", Выборка.Серия);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ВУНомер", Выборка.Номер);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ВУДатаВыдачи", Выборка.ДатаВыдачи);
		
		Если ТипЗнч(УчетныйОбъект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ТекущееФИО = УчетныйОбъект.Наименование;
		Иначе
			ТекущееФИО = Строка(УчетныйОбъект);
		КонецЕсли;
		
		ДанныеФИО = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(ТекущееФИО, " ");
		Если ДанныеФИО.Количество() > 1 Тогда
			
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"Имя", ДанныеФИО[1]);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"Фамилия", ДанныеФИО[0]);
			
			Если ДанныеФИО.Количество() > 3 Тогда
				Отчество = ДанныеФИО[2] + " " + ДанныеФИО[3];
			ИначеЕсли ДанныеФИО.Количество() > 2 Тогда
				Отчество = ДанныеФИО[2];
			КонецЕсли;
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"Отчество", Отчество);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает связанные учётные документы для поиска ЭЗЗ при вводе ЭТрН.
// Например, для РТУ — ЗаказКлиента (ERP) или ЗаказПокупателя (УПП).
//
// Параметры:
//  ДокументОснование - ДокументСсылка - учётный документ, из которого вводится ЭТрН
//
// Возвращаемое значение:
//  Массив из ДокументСсылка
//
Функция СвязанныеОснованияДляПоискаЭЗЗ(ДокументОснование) Экспорт
	
	Результат = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию();
	МодульКонвертацииТиповойКонфигурации = МодульКонвертацииТиповойКонфигурации(ИмяКонфигурации);
	Если МодульКонвертацииТиповойКонфигурации = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Результат = МодульКонвертацииТиповойКонфигурации.СвязанныеОснованияДляПоискаЭЗЗ(ДокументОснование);
	Исключение
		// Метод может отсутствовать в модуле семейства конфигурации
		Возврат Результат;
	КонецПопытки;
	
	Если ТипЗнч(Результат) <> Тип("Массив") Тогда
		Результат = Новый Массив;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает документы-основания для заполнения ТЧ Товары ЗЗ.
// При настройке «1 ЭЗЗ из нескольких документов» — все основания из ДокументыОснования логистического документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект.КонтурЛогистика_ЗЗ_Титул1
//  ДокументОснование - ДокументСсылка - текущее основание конвертации
//
// Возвращаемое значение:
//  Массив из ДокументСсылка
//
Функция ОснованияДляЗаполненияТоваровЗЗ(ДокументОбъект, ДокументОснование) Экспорт
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяМногиеКОдномуЭЗЗ")
		И ДокументОбъект.ДокументыОснования.Количество() > 1 Тогда
		
		Результат = Новый Массив;
		Для Каждого СтрокаОснования Из ДокументОбъект.ДокументыОснования Цикл
			Если ЗначениеЗаполнено(СтрокаОснования.ДокументОснование) Тогда
				Результат.Добавить(СтрокаОснования.ДокументОснование);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОснование);
	
КонецФункции

// Возвращает документы-основания для заполнения ТЧ Товары ТрН Титул 1.
// При настройке «1 ЭТрН из нескольких документов» — все основания из ДокументыОснования логистического документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект.КонтурЛогистика_ТрН_Титул1
//  ДокументОснование - ДокументСсылка - текущее основание конвертации
//
// Возвращаемое значение:
//  Массив из ДокументСсылка
//
Функция ОснованияДляЗаполненияТоваровТрН(ДокументОбъект, ДокументОснование) Экспорт
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяМногиеКОдному")
		И ДокументОбъект.ДокументыОснования.Количество() > 1 Тогда
		
		Результат = Новый Массив;
		Для Каждого СтрокаОснования Из ДокументОбъект.ДокументыОснования Цикл
			Если ЗначениеЗаполнено(СтрокаОснования.ДокументОснование) Тогда
				Результат.Добавить(СтрокаОснования.ДокументОснование);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОснование);
	
КонецФункции

// Формирует путь к реквизиту учетного документа для запроса списка задач
// с учетом запасного значения (аналог ?(ЗначениеЗаполнено(Основной), Основной, Запасной) при заполнении).
//
// Параметры:
//  ИмяТаблицы - Строка - имя документа учетной системы (псевдоним таблицы в запросе)
//  ОсновнойРеквизит - Строка
//  ЗапаснойРеквизит - Строка
//  ТипДокумента1С - Строка
//
// Возвращаемое значение:
//  Строка - выражение языка запросов
//
Функция ПутьРеквизитаСЗапаснымЗначением(ИмяТаблицы, ОсновнойРеквизит, ЗапаснойРеквизит, ТипДокумента1С) Экспорт
	
	ПустоеЗначениеОсновного = ПустоеЗначениеРеквизитаДокументаДляЗапроса(ТипДокумента1С, ОсновнойРеквизит);
	
	Возврат "ВЫБОР
			|	КОГДА " + ИмяТаблицы + "." + ОсновнойРеквизит + " <> " + ПустоеЗначениеОсновного + "
			|		ТОГДА " + ИмяТаблицы + "." + ОсновнойРеквизит + "
			|	ИНАЧЕ " + ИмяТаблицы + "." + ЗапаснойРеквизит + "
			|КОНЕЦ";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТаблицуТоваровПоПЭ_Маршруту(ДокументОбъект, Источник)
	
	ДефолтМетодОпределенияМассы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("МетодОпределенияМассы");
	
	Для Каждого СтрокаГруз Из Источник.Товары Цикл
		
		СтрокаТовары = ДокументОбъект.Товары.Добавить();
		СтрокаТовары.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
		
		СтрокаТовары.ОтгрузочноеНаименование = СтрокаГруз.ОтгрузочноеНаименование;
		СтрокаТовары.КоличествоМест = СтрокаГруз.КоличествоМест;
		СтрокаТовары.ОбъемКубМ = СтрокаГруз.ОбъемКубМ;
		
		СтрокаТовары.МассаПлановаяБруттоКг = СтрокаГруз.МассаБруттоКг;
		СтрокаТовары.МассаПлановаяНеттоКг = СтрокаГруз.МассаНеттоКг;
		СтрокаТовары.МетодОпределенияМассы = ДефолтМетодОпределенияМассы;
		
		СтрокаТовары.Учитывать = Истина;
		
		Если ЗначениеЗаполнено(СтрокаГруз.СвОпаснГруз) Тогда
			ОписаниеОпасногоГруза = ДокументОбъект.ОпасныеГрузы.Добавить();
			ОписаниеОпасногоГруза.ИдентификаторСтрокиТоваров = СтрокаТовары.ИдентификаторСтроки;
			ЗаполнитьЗначенияСвойств(ОписаниеОпасногоГруза, СтрокаГруз.СвОпаснГруз);
		КонецЕсли;
		
		Упаковки = Источник.ИнфУпГруз.НайтиСтроки(Новый Структура("ИдентификаторСтрокиТоваров", СтрокаГруз.ИдентификаторСтроки));
		Если Упаковки.Количество() = 1 Тогда
			СтрокаТовары.ВидТары = Упаковки[0].ВидУпак;
			СтрокаТовары.Высота = Упаковки[0].ВысЗнач;
			СтрокаТовары.Длина = Упаковки[0].ДлЗнач;
			СтрокаТовары.Ширина = Упаковки[0].ШирЗнач;
		КонецЕсли;
		
		СтрокаТовары.СостояниеГруза = "В соответствии с договором";
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПустоеЗначениеРеквизитаДокументаДляЗапроса(ТипДокумента1С, ИмяРеквизита)
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ТипДокумента1С);
	Если МетаданныеДокумента = Неопределено Тогда
		Возврат "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	
	Реквизит = МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита);
	Если Реквизит = Неопределено Тогда
		Возврат "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	
	ТипыРеквизита = Реквизит.Тип.Типы();
	Если ТипыРеквизита.Количество() = 0 Тогда
		Возврат "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	
	МетаданныеТипа = Метаданные.НайтиПоТипу(ТипыРеквизита[0]);
	Если МетаданныеТипа = Неопределено Тогда
		Возврат "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	
	ПолноеИмяТипа = МетаданныеТипа.ПолноеИмя();
	Возврат "ЗНАЧЕНИЕ(" + ПолноеИмяТипа + ".ПустаяСсылка)";
	
КонецФункции

Функция МодульКонвертацииТиповойКонфигурации(ИмяКонфигурации)
	
	Если Не ЗначениеЗаполнено(ИмяКонфигурации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Найдем общий модуль по семействам конфигураций
	Если ИмяКонфигурации = "ERP"
		Или ИмяКонфигурации = "КА_2"
		Или ИмяКонфигурации = "УФ_УТ" Тогда
		
		// Семество ERP
		ИмяКонфигурацииЛок = "ERP";
		
	ИначеЕсли ИмяКонфигурации = "УПП"
		Или ИмяКонфигурации = "УТ"
		Или ИмяКонфигурации = "КА" Тогда
		
		// Семейство УПП (обычные формы)
		ИмяКонфигурацииЛок = "УПП";
		
	ИначеЕсли ИмяКонфигурации = "УАТ"
		Или ИмяКонфигурации = "УАТ_ПРОФ"
		Или ИмяКонфигурации = "ТЛЭ"
		Или ИмяКонфигурации = "ERP_УАТ" Тогда
		
		// Сесмейство УАТ
		ИмяКонфигурацииЛок = "УАТ";
		
	Иначе
		
		// Все остальные, как БП, УНФ и т.д.
		ИмяКонфигурацииЛок = ИмяКонфигурации;
		
	КонецЕсли;
	
	// Имя модуля обработки
	ИмяМодуля = "КонтурЛогистика_КонвертацияТиповые" + ИмяКонфигурацииЛок;
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль(ИмяМодуля);
	
КонецФункции

#КонецОбласти
